zephyrproject-rtos/hal_stm32/lib/stm32wb0/BLE_TransparentMode/STM32_BLE/Target/bleplat_cntr.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    bleplat_cntr.c
  * @author  GPM WBL Application Team
  * @brief   This file provides implementation of BLE controller interface.
  *          WARNING: This module is used by Bluetooth LE stack. Do not use this
  *          module while Bluetooth LE stack is active.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "stm32wb0x.h"
#include "bleplat_cntr.h"
#include <string.h>

/** @defgroup BLE_Platform_Controller  BLE Manager
* @{
*/

/** @defgroup BLE_Platform_Controller_TypesDefinitions Private Type Definitions
* @{
*/
/**
* @}
*/

/** @defgroup BLE_Platform_Controller_Private_Defines Private Defines
* @{
*/

#define MAX_PA_LEVEL    31
#define HP_PA_LEVEL     32 /* Fake PA level that can be reached in high power mode. */

#ifndef CONV_ADR
#define CONV_ADR(ADDR) ((uint8_t*)(ADDR))
#endif

#ifndef LL_PHY_CODED
#define LL_PHY_CODED 0x04U
#endif

#if defined (STM32WB06) || defined (STM32WB07)

#define ANY_HW_ERROR_INTERRUPT_Msk ( \
        BLUE_STATUSREG_ADDPOINTERROR_Msk      |  \
        BLUE_STATUSREG_RXOVERFLOWERROR_Msk    |  \
        BLUE_STATUSREG_TXERROR_0_Msk          |  \
        BLUE_STATUSREG_TXERROR_1_Msk          |  \
        BLUE_STATUSREG_TXERROR_2_Msk          |  \
        BLUE_STATUSREG_TXERROR_3_Msk          |  \
        BLUE_STATUSREG_TXERROR_4_Msk          |  \
        BLUE_STATUSREG_ALLTABLEREADYERROR_Msk | \
        BLUE_STATUSREG_TXDATAREADYERROR_Msk   | \
        BLUE_STATUSREG_NOACTIVELERROR_Msk     | \
        BLUE_STATUSREG_INITDELAYERROR_Msk     | \
        BLUE_STATUSREG_SEMATIMEOUTERROR_Msk   | \
        BLUE_STATUSREG_ACTIVE2ERROR_Msk       | \
        BLUE_STATUSREG_CONFIGERROR_Msk          \
        )

#define RADIO_FSM_RX_DELAY_CAL              (116U)
#define RADIO_FSM_RX_DELAY_NO_CAL            (56U)
#define RADIO_FSM_TX_DELAY_CAL              (118U)
#define RADIO_FSM_TX_DELAY_NO_CAL            (58U)

#elif defined (STM32WB05) || defined (STM32WB09)

#define ANY_HW_ERROR_INTERRUPT_Msk ( \
        BLUE_STATUSREG_ADDPOINTERROR_Msk      |  \
        BLUE_STATUSREG_RXOVERFLOWERROR_Msk    |  \
        BLUE_STATUSREG_TXERROR_0_Msk          |  \
        BLUE_STATUSREG_TXERROR_1_Msk          |  \
        BLUE_STATUSREG_TXERROR_2_Msk          |  \
        BLUE_STATUSREG_TXERROR_3_Msk          |  \
        BLUE_STATUSREG_TXERROR_4_Msk          |  \
        BLUE_STATUSREG_ALLTABLEREADYERROR_Msk | \
        BLUE_STATUSREG_TXDATAREADYERROR_Msk   | \
        BLUE_STATUSREG_NOACTIVELERROR_Msk     | \
        BLUE_STATUSREG_SEMATIMEOUTERROR_Msk   | \
        BLUE_STATUSREG_ACTIVE2ERROR_Msk       | \
        BLUE_STATUSREG_CONFIGERROR_Msk          \
        )

#define RADIO_FSM_RX_DELAY_CAL               (90U)
#define RADIO_FSM_RX_DELAY_NO_CAL            (50U)
#define RADIO_FSM_TX_DELAY_CAL               (92U)
#define RADIO_FSM_TX_DELAY_NO_CAL            (52U)

#endif

#ifndef LL_PHY_CODED
#define LL_PHY_CODED 0x04U
#endif

#ifndef CONV_ADR
#define CONV_ADR(ADDR) ((uint8_t*)(ADDR))
#endif

#ifndef BLUE_TRANS_STRUCT_PTR_CAST
#define BLUE_TRANS_STRUCT_PTR_CAST(PTR) ((BlueTransStruct*)(void*)(uint8_t*)(PTR))
#endif

#define PHY_1MBPS          (0x0U)
#define PHY_2MBPS          (0x1U)
#define PHY_CODED_S2       (0x6U)
#define PHY_CODED_S8       (0x4U)

/**
* @}
*/

/** @defgroup BLE_Platform_Controller_Private_Variables Private Variables
* @{
*/

/**
* @}
*/

/** @defgroup BLE_Platform_Controller_External_Variables External Variables
* @{
*/
/**
* @}
*/

/** @defgroup BLE_Platform_Controller_Private_FunctionPrototypes Private Function Prototypes
* @{
*/

/**
* @}
*/

/** @defgroup BLE_Platform_Controller_Private_Functions Private Functions
* @{
*/

/**
* @}
*/

/** @defgroup BLE_Platform_Controller_Public_Functions Public Functions
* @{
*/

BLEPLAT_CNTR_ResultStatus BLEPLAT_CNTR_Init(void)
{

  return BLEPLAT_CNTR_SUCCESS;
}

BLEPLAT_CNTR_ResultStatus BLEPLAT_CNTR_Deinit(void)
{

  return BLEPLAT_CNTR_SUCCESS;
}

/* Calculate the Timeout to be programmed on Timer2 to obtain a give T_IFS
   when the next packet is a transmit one */
uint32_t BLEPLAT_CNTR_GetTimer2TimeoutForIfs(uint32_t T_Ifs, BLEPLAT_CNTR_Transaction Transaction, uint8_t Rx_Phy, uint8_t Tx_Phy, uint8_t Cal_Enabled)
{
  uint32_t Timeout = T_Ifs;
  uint32_t Tx_Delay_Comp;
  uint32_t Init_Delay = 0;

  if(Transaction == BLEPLAT_CNTR_RxTx)
  {
    /* The correction values below have been determined by T_IFS measurements in
       connection, initiating and active scanning */
#if defined(STM32WB06) || defined(STM32WB07)

    const int32_t Adjust_Value = 4;

#elif defined (STM32WB05) || defined (STM32WB09)

    int32_t Adjust_Value;

    if((Rx_Phy == PHY_1MBPS) &&
       (Tx_Phy == PHY_1MBPS))
    {
      Adjust_Value = 4;
    }
    else if((Rx_Phy == PHY_1MBPS) &&
            (Tx_Phy == PHY_2MBPS))
    {
      Adjust_Value = 3;
    }
    else if((Rx_Phy == PHY_1MBPS) &&
            ((Tx_Phy == PHY_CODED_S2) || (Tx_Phy == PHY_CODED_S8)))
    {
      Adjust_Value = 4;
    }
    else if((Rx_Phy == PHY_2MBPS) &&
            ((Tx_Phy == PHY_1MBPS) || (Tx_Phy == PHY_CODED_S2) || (Tx_Phy == PHY_CODED_S8)))
    {
      Adjust_Value = 6;
    }
    else if((Rx_Phy == PHY_2MBPS) &&
            (Tx_Phy == PHY_2MBPS))
    {
      Adjust_Value = 4;
    }
    else if(((Rx_Phy == PHY_CODED_S2) || (Rx_Phy == PHY_CODED_S8)) &&
            (Tx_Phy == PHY_1MBPS))
    {
      Adjust_Value = 5;
    }
    else if(((Rx_Phy == PHY_CODED_S2) || (Rx_Phy == PHY_CODED_S8)) &&
            (Tx_Phy == PHY_2MBPS))
    {
      Adjust_Value = 4;
    }
    else if(((Rx_Phy == PHY_CODED_S2) || (Rx_Phy == PHY_CODED_S8)) &&
            ((Tx_Phy == PHY_CODED_S2) || (Tx_Phy == PHY_CODED_S8)))
    {
      Adjust_Value = 5;
    }
    else
    {
      Adjust_Value = 6;
    }
#endif

    Tx_Delay_Comp = (RADIO_TXDELAY_START>>3) + Adjust_Value;
  }
  else if(Transaction == BLEPLAT_CNTR_TxRx)
  {
    /* The correction values below have been set to correspond to the hardcoded
       values used in previous versions of the stack.
       They could be optimized after careful analysis of timing margins and
       AGC behavior. */
    const int32_t Adjust_Value = 4;

    Tx_Delay_Comp = (RADIO_TXDELAY_END>>3) + Adjust_Value;
  }
  else if(Transaction == BLEPLAT_CNTR_TxTx)
  {
    /* The correction values below have been determined by sniffer
    * T_IFS measurements in extended advertising (AUX_CHAIN_IND)
    */
#if defined(STM32WB06) || defined(STM32WB07)

    const int32_t Adjust_Value = 1;

