zephyrproject-rtos/hal_stm32/lib/stm32wb0/BLE_TransparentMode/STM32_BLE/Target/bleplat_cntr.c
#elif defined (STM32WB05) || defined (STM32WB09)

    const int32_t Adjust_Value = 2;

#endif

    Tx_Delay_Comp = ((RADIO_TXDELAY_START + RADIO_TXDELAY_END)>>3) + Adjust_Value;
  }
  else
  {
    Tx_Delay_Comp = 0;
  }

  if((Transaction == BLEPLAT_CNTR_RxTx) || (Transaction == BLEPLAT_CNTR_TxTx))
  {
    if(Cal_Enabled == TRUE)
    {
      Init_Delay = RADIO_INITDELAY_TIMER12_CAL + RADIO_FSM_TX_DELAY_CAL;
    }
    else
    {
      Init_Delay = RADIO_INITDELAY_TIMER2_NOCAL + RADIO_FSM_TX_DELAY_NO_CAL;
    }
  }
  else if((Transaction == BLEPLAT_CNTR_TxRx) || (Transaction == BLEPLAT_CNTR_RxRx))
  {
    /* The calculation below is based on the following sequence:
         * - When Timer2 expires the sequencer performs the 1st initialization step and sends
    *   a take_req to the radio
    * - When RADIO_INITDELAY_TIMER12_CAL or RADIO_INITDELAY_TIMER2_NOCAL expire the sequencer sends
    *   a tx_rx_req to the radio
    * - When the radio FSM reaches the RX state (after RADIO_FSM_RX_DELAY_CAL or
    *   RADIO_FSM_RX_DELAY_NO_CAL) the demodulator is turned on
    *
    * The sum of Timer2 timeout +  TIMER(1)2_INIT_DELAY(_NO)_CAL + RADIO_FSM_RX_DELAY(_NO)_CAL
    * must be equal to the T IFS.
    *
    * The current calculation of Timer2 for TX-RX events is slightly conservative
    * since it soes not consider the delay from digital modulator to antenna and from
    * antenna to digital demodulator. As a consequence the demodulator is turned on
    * a few microseconds earlier than stricty needed.
    */
    if(Cal_Enabled == TRUE)
    {
      Init_Delay = RADIO_INITDELAY_TIMER12_CAL + RADIO_FSM_RX_DELAY_CAL;
    }
    else
    {
      Init_Delay = RADIO_INITDELAY_TIMER2_NOCAL + RADIO_FSM_RX_DELAY_NO_CAL;
    }
  }
  else
  {
  }

  Timeout -= (Init_Delay + Tx_Delay_Comp);

  return Timeout;
}

void BLEPLAT_CNTR_ClearInterrupt(uint32_t x)
{
    LL_RADIO_BlueSetInterrupt1RegRegister(x);
}

void BLEPLAT_CNTR_ClearSemareq(void)
{
    LL_RADIO_BlueSetClearSemaphoreRequest(0x1U);
}

void BLEPLAT_CNTR_TxRxSkip(void)
{
    LL_RADIO_BlueSetTxRxSkip(0x1U);
}

uint32_t* BLEPLAT_CNTR_GetCipherTextPtr()
{
    return (uint32_t*)&BLUE->MANAESCIPHERTEXT0REG;
}

uint32_t* BLEPLAT_CNTR_GetClrTextPtr()
{
    return (uint32_t*)&BLUE->MANAESCLEARTEXT0REG;
}

uint32_t* BLEPLAT_CNTR_GetEncKeyPtr()
{
    return (uint32_t*)&BLUE->MANAESKEY0REG;
}

uint8_t BLEPLAT_CNTR_GetEncryptDoneStatus()
{
    return (uint8_t)!LL_RADIO_BlueGetManAESStatusBusy();
}

uint8_t BLEPLAT_CNTR_GetIqsamplesMissingError(void)
{
#if defined(STM32WB09) || defined(STM32WB05)
  return (uint8_t)LL_RADIO_GetIQSamplesMissingError();
#elif defined(STM32WB06) || defined(STM32WB07)
  return (uint8_t)0;
#endif
}

uint8_t BLEPLAT_CNTR_GetIqsamplesNumber(void)
{
#if defined(STM32WB09) || defined(STM32WB05)
  return (uint8_t)LL_RADIO_GetIQSamplesNumber();
#elif defined(STM32WB06) || defined(STM32WB07)
  return (uint8_t)0;
#endif
}

uint8_t BLEPLAT_CNTR_getIqsamplesReady(void)
{
#if defined(STM32WB09) || defined(STM32WB05)
    return (uint8_t)LL_RADIO_GetIQSamplesReady();
#elif defined(STM32WB06) || defined(STM32WB07)
  return (uint8_t)0;
#endif
}

uint8_t BLEPLAT_CNTR_GetIsrLatency()
{
    return (uint8_t)LL_RADIO_BlueGetInterrupt1Latency();
}

uint32_t BLEPLAT_CNTR_GetTimercapture()
{
    return LL_RADIO_BlueGetTimerCapture();
}

void BLEPLAT_CNTR_GlobDisableBlue()
{
    LL_RADIO_GlobalDisableBlue();
}

void BLEPLAT_CNTR_GlobEnableBlue()
{
    LL_RADIO_GlobalEnableBlue();
}

void BLEPLAT_CNTR_GlobEnableIntnoactivelerrorInt()
{
   LL_RADIO_NoActiveLErrorInterrupt_Enable();
}

void BLEPLAT_CNTR_GlobEnableOverrunAct2Int()
{
    LL_RADIO_Active2ErrorInterrupt_Enable();
}

uint8_t BLEPLAT_CNTR_GlobGetDefaultAntennaid()
{
#if defined(GLOBAL_WORD6_DEFAULTANTENNAID_Msk)
    return (uint8_t)LL_RADIO_GetDefaultAntennaID();
#else
    return (uint8_t)0;
#endif
}

uint8_t BLEPLAT_CNTR_GlobGetWakeupinitdelay()
{
    return (uint8_t) LL_RADIO_GetWakeupInitDelay();
}

void BLEPLAT_CNTR_GlobReloadRadioConfigP()
{
    *(uint32_t*)(RRM_BASE + 0x10U) = 0x01U;
}

void BLEPLAT_CNTR_GlobSetChkflagautoclearena()
{
    LL_RADIO_ChkFlagAutoclearEnable_Enable();
}

void BLEPLAT_CNTR_GlobSetDefaultAntennaid(uint8_t x)
{
#if defined(GLOBAL_WORD6_DEFAULTANTENNAID_Msk)
    LL_RADIO_SetDefaultAntennaID((uint32_t)x);
#else
    /* nothing to do */
#endif
}

void BLEPLAT_CNTR_GlobSetInitRadioDelayTxCal(uint8_t x)
{
    LL_RADIO_SetTransmitCalDelayChk((uint32_t) x);
}

void BLEPLAT_CNTR_GlobSetInitRadioDelayTxNocal(uint8_t x)
{
    LL_RADIO_SetTransmitNoCalDelayChk((uint32_t) x);
}

void BLEPLAT_CNTR_GlobSetRadioConfigP(volatile uint32_t* x)
{
    LL_RADIO_SetRadioConfigurationAddressPointer(x[0]);
}

void BLEPLAT_CNTR_GlobSetWakeupinitdelay(uint8_t x)
{
    LL_RADIO_SetWakeupInitDelay((uint32_t) x);
}

void BLEPLAT_CNTR_GlobWriteConfigEnd(uint8_t x)
{
    LL_RADIO_SetConfigurationEndDuration((uint32_t) x);
}

void BLEPLAT_CNTR_GlobWritePeriodslow(uint16_t x)
{
    /* nothing to do */
}

void BLEPLAT_CNTR_GlobWriteRcvdelay(uint8_t x)
{
    LL_RADIO_SetReceivedCalDelayChk((uint32_t) x);
}

void BLEPLAT_CNTR_GlobWriteRcvdelay1(uint8_t x)
{
    LL_RADIO_SetReceivedNoCalDelayChk((uint32_t) x);
}

void BLEPLAT_CNTR_GlobWriteSlot(uint8_t slotNo)
{
    LL_RADIO_SetCurrentConnectionMachineNumber((uint32_t) slotNo);
}

void BLEPLAT_CNTR_GlobWriteTimer12initdelaycal(uint8_t x)
{
    LL_RADIO_SetTimer12InitDelayCal((uint32_t) x);
}

void BLEPLAT_CNTR_GlobWriteTimer2initdelaynocal(uint8_t x)
{
    LL_RADIO_SetTimer12InitDelayNoCal((uint32_t) x);
}

void BLEPLAT_CNTR_GlobWriteTxDataReadyCheck(uint8_t x)
{
    LL_RADIO_SetTxDataReadyCheck((uint32_t) x);
}

void BLEPLAT_CNTR_GlobWriteTxReadyTimeout(uint8_t x)
{
	LL_RADIO_SetTransmissionReadyTimeout((uint32_t) x);
}

void BLEPLAT_CNTR_GlobWriteTxdelay(uint8_t x)
{
    LL_RADIO_SetTxDelayStart((uint32_t) x);
}

void BLEPLAT_CNTR_GlobWriteTxdelayEnd(uint8_t x)
{
    LL_RADIO_SetTxDelayEnd((uint32_t) x);
}

uint32_t BLEPLAT_CNTR_IntGetIntStatusAnyHwError(uint32_t x)
{
    return (uint32_t)(x & ANY_HW_ERROR_INTERRUPT_Msk);
}

