zephyrproject-rtos/hal_stm32/lib/stm32wb0/BLE_TransparentMode/STM32_BLE/Target/bleplat_cntr.c
void BLEPLAT_CNTR_PacketSetNextPtr(BLEPLAT_CNTR_TXRXPACK_TypeDef* packetP, BLEPLAT_CNTR_TXRXPACK_TypeDef* packetNextP)
{
    LL_RADIO_SetNextPointer((TXRXPACK_TypeDef*)packetP, (uint32_t) BLUE_STRUCT_PTR_CAST((TXRXPACK_TypeDef*)packetNextP));
}

void BLEPLAT_CNTR_PacketSetNextRxMode(BLEPLAT_CNTR_TXRXPACK_TypeDef* packetP)
{
    LL_RADIO_SetNextTxMode((TXRXPACK_TypeDef*)packetP, (uint32_t) 0x0);
}

void BLEPLAT_CNTR_PacketSetNextSlot(BLEPLAT_CNTR_TXRXPACK_TypeDef* packetP, uint8_t slot)
{
    /* nothing to do */
}

void BLEPLAT_CNTR_PacketSetNextTxMode(BLEPLAT_CNTR_TXRXPACK_TypeDef* packetP)
{
    LL_RADIO_SetNextTxMode((TXRXPACK_TypeDef*)packetP, (uint32_t) 0x1);
}

void BLEPLAT_CNTR_PacketSetNsEn(BLEPLAT_CNTR_TXRXPACK_TypeDef* packetP)
{
    LL_RADIO_AutomaticSnNesnHardwareMechanism_Enable((TXRXPACK_TypeDef*)packetP);
}

void BLEPLAT_CNTR_PacketSetPllTrig(BLEPLAT_CNTR_TXRXPACK_TypeDef* packetP)
{
    LL_RADIO_SetCalibrationRequest((TXRXPACK_TypeDef*)packetP, (uint32_t) 0x1);
}

void BLEPLAT_CNTR_PacketSetRxReady(BLEPLAT_CNTR_TXRXPACK_TypeDef* packetP)
{
    LL_RADIO_SetAllTableDataReady((TXRXPACK_TypeDef*)packetP, (uint32_t) 0x1);
}

void BLEPLAT_CNTR_PacketSetTimeout(BLEPLAT_CNTR_TXRXPACK_TypeDef* packetP, uint32_t x)
{
    LL_RADIO_SetTimer2Triggering((TXRXPACK_TypeDef*)packetP, x);
}

void BLEPLAT_CNTR_PacketSetTimer2Active(BLEPLAT_CNTR_TXRXPACK_TypeDef* packetP)
{
    LL_RADIO_Timer2_Enable((TXRXPACK_TypeDef*)packetP);
}

void BLEPLAT_CNTR_PacketSetTimerTrigDone(BLEPLAT_CNTR_TXRXPACK_TypeDef* packetP)
{
    LL_RADIO_SetTrigDone((TXRXPACK_TypeDef*)packetP, (uint32_t) 0x1);
}

void BLEPLAT_CNTR_PacketSetTimerTrigRcv(BLEPLAT_CNTR_TXRXPACK_TypeDef* packetP)
{
    LL_RADIO_SetTrigRcv((TXRXPACK_TypeDef*)packetP, (uint32_t) 0x1);
}

void BLEPLAT_CNTR_PacketSetTxReady(BLEPLAT_CNTR_TXRXPACK_TypeDef* packetP)
{
    LL_RADIO_SetTransmissionDataReady((TXRXPACK_TypeDef*)packetP, (uint32_t) 0x1);
    LL_RADIO_SetAllTableDataReady((TXRXPACK_TypeDef*)packetP, (uint32_t) 0x1);
}

void BLEPLAT_CNTR_SetRadioConfig(uint8_t* value)
{
    /* nothing to do */
}

void BLEPLAT_CNTR_SetRcvLen(BLEPLAT_CNTR_TXRXPACK_TypeDef* packetP, uint32_t rcvLen)
{
  (void)packetP;
  LL_RADIO_SetReceiveWindowTimeout((uint32_t) (rcvLen & 0xFFFFFU));
}

void BLEPLAT_CNTR_SmCteOff(uint8_t smNo)
{
#if defined(STM32WB05) || defined(STM32WB09)
  LL_RADIO_SetCTEDisable(smNo, 0x01);
#elif defined(STM32WB06) || defined(STM32WB07)
  /* nothing to do */
#endif
}

void BLEPLAT_CNTR_SmCteOn(uint8_t smNo)
{
#if defined(STM32WB05) || defined(STM32WB09)
  LL_RADIO_SetCTEDisable(smNo, 0x00);
#elif defined(STM32WB06) || defined(STM32WB07)
  /* nothing to do */
#endif
}

void BLEPLAT_CNTR_SmEnRadioConfig(uint8_t smNo, uint32_t enable)
{
    if(enable)
	    LL_RADIO_RadioCommandList_Enable(smNo);
	else
	    LL_RADIO_RadioCommandList_Disable(smNo);
}

void BLEPLAT_CNTR_SmEncOff(uint8_t smNo)
{
    LL_RADIO_Encryption_Disable(smNo);
    LL_RADIO_ReceiveEncryptionErrorInterrupt_Disable(smNo);
}

void BLEPLAT_CNTR_SmEncOn(uint8_t smNo)
{
    LL_RADIO_Encryption_Enable(smNo);
    LL_RADIO_ReceiveEncryptionErrorInterrupt_Enable(smNo);
}

uint32_t BLEPLAT_CNTR_SmGetAccessAddr(uint8_t smNo)
{
    return LL_RADIO_GetAccessAddress(smNo);
}

void BLEPLAT_CNTR_SmGetChannelMap(uint8_t smNo, uint8_t* chanMap)
{
    chanMap[0] = (uint8_t)(LL_RADIO_GetUsedChannelFlags_15_0(smNo));
    chanMap[1] = (uint8_t)(LL_RADIO_GetUsedChannelFlags_15_0(smNo) >> 8U);
    chanMap[2] = (uint8_t)(LL_RADIO_GetUsedChannelFlags_36_16(smNo));
    chanMap[3] = (uint8_t)(LL_RADIO_GetUsedChannelFlags_36_16(smNo) >> 8U);
    chanMap[4] = (uint8_t)(LL_RADIO_GetUsedChannelFlags_36_16(smNo) >> 16U);
}

uint8_t BLEPLAT_CNTR_SmGetCteAntennaPatternLen(uint8_t smNo)
{
#if defined(STM32WB05) || defined(STM32WB09)
    return (uint8_t)LL_RADIO_GetAntennaPatternLength(smNo);
#elif defined(STM32WB06) || defined(STM32WB07)
  return (uint8_t)0;
#endif
}

uint8_t BLEPLAT_CNTR_SmGetCteAodNaoa(uint8_t smNo)
{
#if defined(STM32WB05) || defined(STM32WB09)
    return (uint8_t)LL_RADIO_GetAodNaoa(smNo);
#elif defined(STM32WB06) || defined(STM32WB07)
  return (uint8_t)0;
#endif
}

uint8_t BLEPLAT_CNTR_SmGetCteSlotWidth(uint8_t smNo)
{
#if defined(STM32WB05) || defined(STM32WB09)
  return (uint8_t)LL_RADIO_GetCTESlotWidth(smNo);
#elif defined(STM32WB06) || defined(STM32WB07)
  return (uint8_t)0;
#endif
}

uint8_t BLEPLAT_CNTR_SmGetCteStatus(uint8_t smNo)
{
#if defined(STM32WB05) || defined(STM32WB09)
    return (uint8_t)LL_RADIO_GetCTEDisable(smNo);
#elif defined(STM32WB06) || defined(STM32WB07)
  return (uint8_t)0;
#endif
}

uint8_t BLEPLAT_CNTR_SmGetCteTime(uint8_t smNo)
{
#if defined(STM32WB05) || defined(STM32WB09)
  return (uint8_t)LL_RADIO_GetCTETime(smNo);
#elif defined(STM32WB06) || defined(STM32WB07)
  return (uint8_t)0;
#endif
}

uint32_t* BLEPLAT_CNTR_SmGetEncIvPtr(uint8_t smNo)
{
    return (uint32_t*)&(bluedata + smNo)->ENCRYPTIV[0];
}

uint32_t* BLEPLAT_CNTR_SmGetEncKeyPtr(uint8_t smNo)
{
	return (uint32_t*)&(bluedata + smNo)->ENCRYPTK[0];
}

uint8_t BLEPLAT_CNTR_SmGetEncStatus(uint8_t smNo)
{
    return (uint8_t)LL_RADIO_Encryption_IsEnabled(smNo);
}

uint8_t BLEPLAT_CNTR_SmGetHopIncr(uint8_t smNo)
{
    return (uint8_t)LL_RADIO_GetHopIncrement(smNo);
}

uint8_t BLEPLAT_CNTR_SmGetMode(uint8_t smNo)
{
    return LL_RADIO_TxMode_IsEnabled(smNo);
}

uint8_t* BLEPLAT_CNTR_SmGetPrevRxPacketDataPtr(uint8_t smNo)
{
    return (uint8_t*)CONV_ADR(BLUE_TRANS_STRUCT_PTR_CAST(LL_RADIO_GetRcvPointPrevious(smNo))->DATAPTR);
}

BLEPLAT_CNTR_TXRXPACK_TypeDef* BLEPLAT_CNTR_SmGetPrevRxPacketPtr(uint8_t smNo)
{
    return (BLEPLAT_CNTR_TXRXPACK_TypeDef*)BLUE_TRANS_STRUCT_PTR_CAST(CONV_ADR(LL_RADIO_GetRcvPointPrevious(smNo)));
}

uint8_t* BLEPLAT_CNTR_SmGetPrevTxPacketDataPtr(uint8_t smNo)
{
    return (uint8_t*)CONV_ADR(BLUE_TRANS_STRUCT_PTR_CAST(LL_RADIO_GetTxPointPrevious(smNo))->DATAPTR);
}

BLEPLAT_CNTR_TXRXPACK_TypeDef* BLEPLAT_CNTR_SmGetPrevTxPacketPtr(uint8_t smNo)
{
    return (BLEPLAT_CNTR_TXRXPACK_TypeDef*)BLUE_TRANS_STRUCT_PTR_CAST(CONV_ADR(LL_RADIO_GetTxPointPrevious(smNo)));
}

