zephyrproject-rtos/hal_stm32/lib/stm32wb0/BLE_TransparentMode/STM32_BLE/Target/bleplat_cntr.c
uint8_t BLEPLAT_CNTR_SmGetRemapChan(uint8_t smNo)
{
    return (uint8_t)LL_RADIO_GetRemapChannel(smNo);
}

void BLEPLAT_CNTR_SmGetRxCount(uint8_t smNo, uint32_t* packetCount)
{

    packetCount[0] = LL_RADIO_GetPacketCounterRx_23_0(smNo);
    packetCount[0] = packetCount[0] | ((uint32_t)LL_RADIO_GetPacketCounterRx_39_24(smNo) << 24U);
    packetCount[1] = LL_RADIO_GetPacketCounterRx_39_24(smNo) >> 8U;
}

uint8_t BLEPLAT_CNTR_SmGetRxPhy(uint8_t smNo)
{
    return (uint8_t)LL_RADIO_GetReceptionPhy(smNo);
}

BLEPLAT_CNTR_TXRXPACK_TypeDef* BLEPLAT_CNTR_SmGetTxPacketPtr(uint8_t smNo)
{
    return (BLEPLAT_CNTR_TXRXPACK_TypeDef*)BLUE_TRANS_STRUCT_PTR_CAST(CONV_ADR(LL_RADIO_GetTxPoint(smNo)));
}

uint8_t BLEPLAT_CNTR_SmGetTxPhy(uint8_t smNo)
{
    return (uint8_t)LL_RADIO_GetTransmissionPhy(smNo);
}

uint8_t BLEPLAT_CNTR_SmGetTxPwr(uint8_t smNo)
{
    uint8_t pa_level = LL_RADIO_GetPAPower(smNo);

#if defined(STM32WB09)
    if (LL_RADIO_TxHp_IsEnabled(smNo) && (pa_level == MAX_PA_LEVEL))
    {
        pa_level = HP_PA_LEVEL;
    }
#endif
    return pa_level;
}

uint8_t BLEPLAT_CNTR_SmGetUnmappedChan(uint8_t smNo)
{
    return (uint8_t)LL_RADIO_GetUnmappedChannel(smNo);
}

void BLEPLAT_CNTR_SmInitTo0(uint8_t smNo)
{
  memset((void*)&bluedata[smNo], 0, sizeof(STATMACH_TypeDef));
  BLEPLAT_CNTR_SmEnRadioConfig(smNo, 0x01);
}

void BLEPLAT_CNTR_SmSetAccessAddr(uint8_t smNo, uint32_t x)
{
    LL_RADIO_SetAccessAddress(smNo, x);
}

void BLEPLAT_CNTR_SmSetChannelMap(uint8_t smNo, uint8_t* chanMap)
{
    uint32_t value = (uint32_t)chanMap[0] | ((uint32_t)chanMap[1] << 8U);
    LL_RADIO_SetUsedChannelFlags_15_0(smNo, value);
    value = (uint32_t)chanMap[2] | ((uint32_t)chanMap[3] << 8U) | ((uint32_t)chanMap[4] << 16U);
    LL_RADIO_SetUsedChannelFlags_36_16(smNo, value);
}

void BLEPLAT_CNTR_SmSetCrcInit(uint8_t smNo, uint32_t x)
{
  LL_RADIO_SetCRCInitializationValue(smNo, x);
}

void BLEPLAT_CNTR_SmSetCteAntennaPatternLen(uint8_t smNo, uint8_t antPattLen)
{
#if defined(STM32WB05) || defined(STM32WB09)
  LL_RADIO_SetAntennaPatternLength(smNo, (uint32_t) antPattLen);
#elif defined(STM32WB06) || defined(STM32WB07)
  /* nothing to do */
#endif
}

uint32_t BLEPLAT_CNTR_SmGetCteAntennaPatternPtr(uint8_t smNo)
{
#if defined(STM32WB05) || defined(STM32WB09)
  return LL_RADIO_GetAntennaPatternPtr(smNo);
#elif defined(STM32WB06) || defined(STM32WB07)
  return 0x00UL;
#endif
}

void BLEPLAT_CNTR_SmSetCteAntennaPatternPtr(uint8_t smNo, uint8_t* antPattP)
{
#if defined(STM32WB05) || defined(STM32WB09)
  LL_RADIO_SetAntennaPatternPtr(smNo, (uint32_t)(uintptr_t)antPattP);
#elif defined(STM32WB06) || defined(STM32WB07)
  /* nothing to do */
#endif
}

void BLEPLAT_CNTR_SmSetCteAoa(uint8_t smNo)
{
#if defined(STM32WB05) || defined(STM32WB09)
  LL_RADIO_SetAodNaoa(smNo, 0x0);
#elif defined(STM32WB06) || defined(STM32WB07)
  /* nothing to do */
#endif
}

void BLEPLAT_CNTR_SmSetCteAod(uint8_t smNo)
{
#if defined(STM32WB05) || defined(STM32WB09)
  LL_RADIO_SetAodNaoa(smNo, 0x01);
#elif defined(STM32WB06) || defined(STM32WB07)
  /* nothing to do */
#endif
}

void BLEPLAT_CNTR_SmSetCteIqsamplesPtr(uint8_t smNo, uint32_t* iqSamplesP)
{
#if defined(STM32WB05) || defined(STM32WB09)
  LL_RADIO_SetIQSamplesPtr(smNo, (uint32_t)(uintptr_t)iqSamplesP);
#elif defined(STM32WB06) || defined(STM32WB07)
  /* nothing to do */
#endif
}

void BLEPLAT_CNTR_SmSetCteMaxIqsamplesNumb(uint8_t smNo, uint8_t iqsamplesNumb)
{
#if defined(STM32WB05) || defined(STM32WB09)
  LL_RADIO_SetMaximumIQSamplesNumber(smNo, (uint32_t) iqsamplesNumb);
#elif defined(STM32WB06) || defined(STM32WB07)
  /* nothing to do */
#endif
}

void BLEPLAT_CNTR_SmSetCteSlotWidth(uint8_t smNo, uint32_t cteSlot)
{
#if defined(STM32WB05) || defined(STM32WB09)
  LL_RADIO_SetCTESlotWidth(smNo, cteSlot);
#elif defined(STM32WB06) || defined(STM32WB07)
  /* nothing to do */
#endif
}

void BLEPLAT_CNTR_SmSetCteTime(uint8_t smNo, uint8_t cteTime)
{
#if defined(STM32WB05) || defined(STM32WB09)
  LL_RADIO_SetCTETime(smNo, (uint32_t) cteTime);
#elif defined(STM32WB06) || defined(STM32WB07)
  /* nothing to do */
#endif
}

void BLEPLAT_CNTR_SmSetDataLength(uint8_t smNo, uint8_t length)
{
    LL_RADIO_SetMaximumReceiveLength(smNo, (uint32_t) length);
}

void BLEPLAT_CNTR_SmSetDataLengthExtnEn(uint8_t smNo)
{
    /* nothing to do */
}

void BLEPLAT_CNTR_SmSetHopIncr(uint8_t smNo, uint8_t x)
{
    LL_RADIO_SetHopIncrement(smNo, (uint32_t) x);
}

void BLEPLAT_CNTR_SmSetRemapChan(uint8_t smNo, uint8_t chan)
{
    LL_RADIO_SetRemapChannel(smNo, chan);
}

void BLEPLAT_CNTR_SmSetRxCount(uint8_t smNo, uint32_t* packetCount)
{
    LL_RADIO_SetPacketCounterRx_23_0(smNo, (uint32_t) packetCount[0]);
    uint32_t value = (uint32_t)(packetCount[1] << 8U) | (uint32_t)(packetCount[0] >> 24U);
    LL_RADIO_SetPacketCounterRx_39_24(smNo, value);
}

void BLEPLAT_CNTR_SmSetRxCountDirectionBit(uint8_t smNo)
{
    uint32_t value = LL_RADIO_GetPacketCounterRx_39_24(smNo) | 0x8000U;
    LL_RADIO_SetPacketCounterRx_39_24(smNo, value);
}

void BLEPLAT_CNTR_SmSetRxMode(uint8_t smNo)
{
    LL_RADIO_TxMode_Disable(smNo);
}

void BLEPLAT_CNTR_SmSetRxPacketPtr(uint8_t smNo, BLEPLAT_CNTR_TXRXPACK_TypeDef* packetP)
{
    LL_RADIO_SetRcvPoint(smNo, (uint32_t) BLUE_STRUCT_PTR_CAST((TXRXPACK_TypeDef*)packetP));
}

void BLEPLAT_CNTR_SmSetRxPhy(uint8_t smNo, uint8_t rxPhy)
{
    LL_RADIO_SetReceptionPhy(smNo, (uint32_t) rxPhy);
}

void BLEPLAT_CNTR_SmSetTxCount(uint8_t smNo, uint32_t* packetCount)
{
    LL_RADIO_SetPacketCounterTx_31_0(smNo, (uint32_t) packetCount[0]);
    LL_RADIO_SetPacketCounterTx_39_32(smNo, (uint32_t) packetCount[1]);
}

void BLEPLAT_CNTR_SmSetTxCountDirectionBit(uint8_t smNo)
{
    uint32_t value =  (LL_RADIO_GetPacketCounterTx_39_32(smNo) | 0x00000080U);
    LL_RADIO_SetPacketCounterTx_39_32(smNo,  value);
}

void BLEPLAT_CNTR_SmSetTxMode(uint8_t smNo)
{
    LL_RADIO_TxMode_Enable(smNo);
}

void BLEPLAT_CNTR_SmSetTxPacketPtr(uint8_t smNo, BLEPLAT_CNTR_TXRXPACK_TypeDef* packetP)
{
    LL_RADIO_SetTxPoint(smNo, (uint32_t) BLUE_STRUCT_PTR_CAST((TXRXPACK_TypeDef*)packetP));
}

void BLEPLAT_CNTR_SmSetTxPhy(uint8_t smNo, uint8_t txPhy)
{
    LL_RADIO_SetTransmissionPhy(smNo, (uint32_t) txPhy);
}

void BLEPLAT_CNTR_SmEnTxHp(uint8_t smNo, uint8_t enable)
{
#if defined(STM32WB09)
  if(enable)
  {
    LL_RADIO_TxHp_Enable(smNo);
  }
  else
  {
    LL_RADIO_TxHp_Disable(smNo);
  }
#endif
}

/* Consider PA Level 32 the one used to enable high power. */
void BLEPLAT_CNTR_SmSetTxPwr(uint8_t smNo, uint8_t paLevel)
{
#if defined(STM32WB09)
  if(paLevel == HP_PA_LEVEL)
  {
    LL_RADIO_TxHp_Enable(smNo);
    paLevel = MAX_PA_LEVEL;
  }
  else
  {
    LL_RADIO_TxHp_Disable(smNo);
  }
#endif

  LL_RADIO_SetPAPower(smNo, (uint32_t) paLevel);
}

void BLEPLAT_CNTR_SmSetUnmappedChan(uint8_t smNo, uint8_t chan)
{
    LL_RADIO_SetUnmappedChannel(smNo, (uint32_t) chan);
}

void BLEPLAT_CNTR_SmToggleNesn(uint8_t smNo)
{
  LL_RADIO_ToggleNextExpectedSequenceNumber(smNo);
}

void BLEPLAT_CNTR_SmToggleSn(uint8_t smNo)
{
    LL_RADIO_ToggleSequenceNumber(smNo);
}

void BLEPLAT_CNTR_StartEncrypt()
{
     LL_RADIO_BlueSetManAESCmdStart(0x1U);
}

uint32_t BLEPLAT_CNTR_TimeDiff(uint32_t x, uint32_t y)
{
    return (uint32_t)(x - y);
}

uint8_t BLEPLAT_CNTR_DemodDelaySt(uint8_t RxPHY)
{
    return (uint8_t)((LL_PHY_CODED == RxPHY) ? 0x9DU : 0x12U);
}

uint32_t BLEPLAT_CNTR_IsEnabledTimer1(void)
{
  return LL_RADIO_TIMER_IsEnabledTimer1(BLUE);
}

/**
* @}
*/

/**
* @}
*/
